let a = 1, b = 1, c, d;

c = ++a; // a сначала добавляется единица (а=a+1=1+1=2), а затем значение а присваивается с (с=2)
console.log(c);

d = b++; // значение b (b=1) сначала присваивается d (d=1), а затем b добавляется единица (b=b+1=1+1=2)
console.log(d);

c = (2 + ++a); // a (a=2) сначала добавляется единица (а=a+1=2+1=3), затем происходит сложение 2+3=5 и значение в скобках присваивается с (с=5)
console.log(c);

d = (2 + b++); // происходит сложение 2+b (b=2), результат в скобках (2+2=4) присваивается d (d=4), и в самом конце b добавляется единица (b=b+1=2+1=3)
console.log(d);

console.log(a);
console.log(b);